JamesBara/STM32L4xx_USB_Device/usbd_core/src/usbd_core.c
#include "stm32_assert.h"
#include "stm32_cpu_delay.h"
#include "usbd_core.h"
#include "usbd_request.h"
#include "usbd_hw.h"

#if 0
enum usbd_event
{
	NONE = 0,
	RESET,
	CTR,
	SETUP,
	SUSPEND,
	WAKEUP,
	PMAOVR,
	SOF,
	ESOF,
	LPM_L1,
	ERROR
};
#define USBD_MAX_EVENT 11
#endif

struct usbd_requests
{
	void (*get_status)(usbd_setup_packet_type setup);
	void (*clear_feature)(usbd_setup_packet_type setup);
	void (*set_feature)(usbd_setup_packet_type setup);
	void (*set_address)(usbd_setup_packet_type setup);
	void (*get_descriptor)(usbd_setup_packet_type setup);
	void (*set_descriptor)(usbd_setup_packet_type setup);
	void (*get_configuration)(usbd_setup_packet_type setup);
	void (*set_configuration)(usbd_setup_packet_type setup);
	void (*get_interface)(usbd_setup_packet_type setup);
	void (*set_interface)(usbd_setup_packet_type setup);
	void (*synch_frame)(usbd_setup_packet_type setup);
	void (*class_request)(usbd_setup_packet_type setup);
	void (*vendor_request)(usbd_setup_packet_type setup);
};

static uint8_t *ep0_buf;
static uint32_t ep0_cnt;
static void (*stage)(void);
static void (*reception_completed)(void);
static struct usbd_requests const *cur_state;
static struct usbd_requests const *prev_state;
static uint16_t device_address;
static usbd_core_config *config;
static void (*ep_handler[8][2])(void);
#if 0
static void (*cur_ep_handler)(void);


static struct usbd_queue
{
	enum usbd_event buffer[USBD_MAX_EVENT + 1];
	uint32_t head;
	uint32_t tail;
}queue;

#define USBD_QUEUE_NEXT_HEAD() ((queue.head + 1 == USBD_MAX_EVENT) ? 0 : (queue.head + 1))
#define USBD_QUEUE_NEXT_TAIL() ((queue.tail + 1 == USBD_MAX_EVENT) ? 0 : (queue.tail + 1))
#define USBD_QUEUE_IS_EMPTY() ((queue.head == queue.tail) ? 1 : 0)
#define USBD_QUEUE_IS_FULL() ((USBD_QUEUE_NEXT_HEAD() == queue.tail) ? 1 : 0)
#endif
static void usbd_ep0_handler(void);
static void usbd_setup_stage(void);
static void usbd_data_out_stage(void);
static void usbd_data_in_stage(void);
static void usbd_status_in_stage(void);
static void usbd_status_out_stage(void);

static void usbd_parse_setup_packet(usbd_setup_packet_type setup);

static void usbd_get_status(usbd_setup_packet_type setup);
static void usbd_clear_feature(usbd_setup_packet_type setup);
static void usbd_set_feature(usbd_setup_packet_type setup);
static void usbd_set_address(usbd_setup_packet_type setup);
static void usbd_get_descriptor(usbd_setup_packet_type setup);
static void usbd_set_descriptor(usbd_setup_packet_type setup);
static void usbd_get_configuration(usbd_setup_packet_type setup);
static void usbd_set_configuration(usbd_setup_packet_type setup);
static void usbd_get_interface(usbd_setup_packet_type setup);
static void usbd_set_interface(usbd_setup_packet_type setup);
static void usbd_synch_frame(usbd_setup_packet_type setup);
static void usbd_class_request(usbd_setup_packet_type setup);
static void usbd_vendor_request(usbd_setup_packet_type setup);

#if 0
static void usbd_event_enqueue(enum usbd_event e);
static enum usbd_event usbd_event_dequeue(void);
#endif
static void usbd_event_generator(void);
static void usbd_reset(void);
#if 0
static void usbd_device_event_handler(enum usbd_event e);
#endif

static const struct usbd_requests default_state =
{
	NULL,
	NULL,
	NULL,
	usbd_set_address,
	usbd_get_descriptor,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL
};

static const struct usbd_requests addressed_state =
{
	usbd_get_status,
	usbd_clear_feature,
	usbd_set_feature,
	usbd_set_address,
	usbd_get_descriptor,
	NULL,
	usbd_get_configuration,
	usbd_set_configuration,
	NULL,
	NULL,
	NULL,
	NULL,
	usbd_vendor_request
};

static const struct usbd_requests configured_state =
{
	usbd_get_status,
	usbd_clear_feature,
	usbd_set_feature,
	NULL,
	usbd_get_descriptor,
	usbd_set_descriptor,
	usbd_get_configuration,
	usbd_set_configuration,
	usbd_get_interface,
	usbd_set_interface,
	usbd_synch_frame,
	usbd_class_request,
	usbd_vendor_request
};

static const struct usbd_requests suspended_state;

static void usbd_ep0_handler(void)
{
	ASSERT(stage != NULL);
	stage();
}


volatile usbd_setup_packet_type packet_dbg[25];
volatile uint32_t packet_dbg_cnt = 0;

static void usbd_setup_stage(void)
{
	usbd_setup_packet_type setup = {0};
	uint16_t count = USBD_PMA_GET_RX_COUNT(EP0);
	
	if(count != USBD_SETUP_PACKET_SIZE)
	{
		USBD_ERROR_LOG(Wrong setup packet size);
		USBD_EP0_SET_STALL();
	}

	usbd_pma_read(ADDR0_RX, (uint8_t*)&setup, count);

	packet_dbg[packet_dbg_cnt] = setup;

	if (packet_dbg_cnt >= 13)
	{
		__BKPT(0);
	}
	packet_dbg_cnt++;
	usbd_parse_setup_packet(setup);
}

static void usbd_data_in_stage(void)
{
	uint32_t cnt = MIN(EP0_COUNT, ep0_cnt);
	/*Decrement the leftover bytes.*/
	ep0_cnt -= cnt;
	/*If it's a short packet the opposite direction is set to NAK.*/
	if(ep0_cnt < EP0_COUNT)
	{
		USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_NAK);	
	}
	/*If there is no leftover data, Data In stage is completed.*/
	if (!ep0_cnt)
	{
		USBD_EP_SET_KIND(EP0);
		stage = usbd_status_out_stage;
		USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_VALID);
		return;
	}
	/*Increment the buffer.*/
	ep0_buf += cnt;
	/*Copy a packet to usb sram*/
	USBD_PMA_SET_TX_COUNT(EP0, MIN(EP0_COUNT, ep0_cnt));
	usbd_pma_write(ep0_buf, ADDR0_TX, MIN(EP0_COUNT, ep0_cnt));
	USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_VALID);
}

static void usbd_data_out_stage(void)
{
	/*Get the rx count and protect from underflow.*/
	uint32_t cnt = MIN(USBD_PMA_GET_RX_COUNT(EP0), ep0_cnt);

	usbd_pma_read(ADDR0_TX, ep0_buf, cnt);
	USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_VALID);
	/*Decrement the leftover bytes.*/
	ep0_cnt -= cnt;

	if (ep0_cnt < EP0_COUNT)
	{
		USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_NAK);
	}

	/*If there is leftover data, increment the buffer pointer.*/
	if (ep0_cnt)
	{
		ep0_buf += cnt;
	}
	/*Otherwise the stage is completed.*/
	else
	{
		stage = usbd_status_in_stage;
	}
}

static void usbd_status_in_stage(void)
{
	if (device_address && cur_state == &default_state)
	{
		cur_state = &addressed_state;
		/*Set the device address.*/
		SET(USB->DADDR, device_address);
	}

