JamesBara/STM32L4xx_USB_Device/usbd_core/src/usbd_core.c
	if (!device_address && cur_state == &addressed_state)
	{
		cur_state = &default_state;
		/*Clear the device address*/
		CLEAR(USB->DADDR, USB_DADDR_ADD);
	}

	if(reception_completed != NULL)
	{
		reception_completed();
	}
	/*Clear the ep0 transfer.*/
	ep0_buf = NULL;
	ep0_cnt = 0;
	stage = NULL;
	/*Not sure if this is correct.*/
	USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_VALID);
	USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_NAK);
}

static void usbd_status_out_stage(void)
{
	/*Clear hardware status out*/
	USBD_EP_CLEAR_KIND(EP0);
	/*Clear the ep0 transfer.*/
	ep0_buf = NULL;
	ep0_cnt = 0;
	stage = NULL;
	USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_VALID);
	USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_NAK);
}

static void usbd_parse_setup_packet(usbd_setup_packet_type setup)
{
    switch(setup.bmRequestType & USBD_TYPE)
    {
        case USBD_TYPE_STANDARD:
        {
            switch(setup.bRequest)
            {
                case USBD_GET_STATUS:
                {
					if(cur_state->get_status == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);						
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->get_status(setup);
                    break;
                }
                case USBD_CLEAR_FEATURE:
                {
					if(cur_state->clear_feature == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);						
						USBD_EP0_SET_STALL();
						return;
					}
					cur_state->clear_feature(setup);
                    break;
                }
                case USBD_SET_FEATURE:
                {
					if(cur_state->set_feature == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);
						USBD_EP0_SET_STALL();
						return;
					}
					cur_state->set_feature(setup);
                    break;            
                }
                case USBD_SET_ADDRESS:
                {
					if(cur_state->set_address == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);
						USBD_EP0_SET_STALL();
						return;
					}
					cur_state->set_address(setup);
                    break;            
                }
                case USBD_GET_DESCRIPTOR:
                {
					if(cur_state->get_descriptor == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);
						USBD_EP0_SET_STALL();
						return;
					}
					cur_state->get_descriptor(setup);
                    break;            
                }
                case USBD_SET_DESCRIPTOR:
                {
					if(cur_state->set_descriptor == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->set_descriptor(setup);
                    break;            
                }
                case USBD_GET_CONFIGURATION:
                {
					if(cur_state->get_configuration == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->get_configuration(setup);
                    break;
                }
                case USBD_SET_CONFIGURATION:
                {
					if(cur_state->set_configuration == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);
						USBD_EP0_SET_STALL();
						return;
					}
					cur_state->set_configuration(setup);
                    break;            
                }
                case USBD_GET_INTERFACE:
                {
					if(cur_state->get_interface == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->get_interface(setup);
                    break;
                }
                case USBD_SET_INTERFACE:
                {
					if(cur_state->set_interface == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->set_interface(setup);
                    break;
                }
                case USBD_SYNCH_FRAME:
                {
					if(cur_state->synch_frame == NULL)
					{
						USBD_ERROR_LOG(Requst not registered. Wrong state?);
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->synch_frame(setup);
                    break;
                }
                default:
                {
					USBD_ERROR_LOG(Invalid bRequest);
					USBD_EP0_SET_STALL();
                    break;
                }
            }
            break;
        }
        case USBD_TYPE_CLASS:
        {
			if(cur_state->class_request == NULL)
			{
				USBD_ERROR_LOG(Requst not registered.);
				USBD_EP0_SET_STALL();
				return;
			}
            cur_state->class_request(setup);
            break;
        }
        case USBD_TYPE_VENDOR:
        {
			if(cur_state->vendor_request == NULL)
			{
				USBD_ERROR_LOG(Requst not registered.);
				USBD_EP0_SET_STALL();
				return;
			}
			cur_state->vendor_request(setup);
            break;
        }
        default:
        {
			USBD_ERROR_LOG(Invalid bmRequestType. Unknown request type.);
			USBD_EP0_SET_STALL();
        }
    }
}

static void usbd_get_status(usbd_setup_packet_type setup)
{
	uint8_t buf[2] = { 0x0U, 0x0U };

	switch (setup.bmRequestType & USBD_RECIPIENT)
	{
		case USBD_RECIPIENT_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->get_remote_wakeup != NULL);
			ASSERT(config->is_selfpowered != NULL);
			buf[0] = config->get_remote_wakeup() ? 1 << 1 : 0 << 1;
			buf[0] |= config->is_selfpowered() ? 1 : 0;
			break;
		}
		case USBD_RECIPIENT_INTERFACE:
		{
			ASSERT(config != NULL);
			ASSERT(config->is_interface_valid != NULL);
			if(!config->is_interface_valid(setup.wIndex & 0x7FU))
			{
				USBD_ERROR_LOG(Invalid interface.);
				USBD_EP0_SET_STALL();
				return;
			}
			break;
		}
		case USBD_RECIPIENT_ENDPOINT:
		{
			uint8_t ep = (setup.wIndex & USBD_EP_ADDRESS_EP_NUMBER);
			uint8_t dir =  (setup.wIndex & USBD_EP_ADDRESS_EP_DIRECTION) ? 1 : 0;
			ASSERT(config != NULL);
			ASSERT(config->is_endpoint_valid != NULL);
			if(!config->is_endpoint_valid(ep, dir))
			{
				USBD_ERROR_LOG(Invalid endpoint.);
				USBD_EP0_SET_STALL();
				return;
			}
			buf[0] = (uint8_t) USBD_EP_GET_STALL(ep, dir) ? 1: 0;
			break;

