JamesBara/STM32L4xx_USB_Device/usbd_core/src/usbd_core.c
		}
		default:
		{
			USBD_ERROR_LOG(Invalid bmRequestType. Unknown recipient);
			USBD_EP0_SET_STALL();
			return;
			break;			
		}
	}
	usbd_prepare_data_in_stage(buf, USBD_GET_STATUS_LENGTH);
}

static void usbd_clear_feature(usbd_setup_packet_type setup)
{
	switch (setup.bmRequestType & USBD_RECIPIENT)
	{
		case USBD_RECIPIENT_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->set_remote_wakeup != NULL);
			config->set_remote_wakeup(false);
			break;	
		}
		case USBD_RECIPIENT_ENDPOINT:
		{
			uint8_t ep = (setup.wIndex & USBD_EP_ADDRESS_EP_NUMBER);
			uint8_t dir =  (setup.wIndex & USBD_EP_ADDRESS_EP_DIRECTION) ? 1 : 0;
			ASSERT(config != NULL);
			ASSERT(config->is_endpoint_valid != NULL);
			if(!config->is_endpoint_valid(ep, dir))
			{
				USBD_ERROR_LOG(Invalid endpoint.);
				USBD_EP0_SET_STALL();
				return;
			}
			ASSERT(config->clear_stall != NULL);
			config->clear_stall(ep, dir);
			break;
		}
		default:
		{
			USBD_ERROR_LOG(Invalid bmRequestType. Unknown recipient);
			USBD_EP0_SET_STALL();
			return;
			break;			
		}
	}
	usbd_prepare_status_in_stage();
}

static void usbd_set_feature(usbd_setup_packet_type setup)
{
	switch (setup.bmRequestType & USBD_RECIPIENT)
	{
		case USBD_RECIPIENT_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->set_remote_wakeup != NULL);
			config->set_remote_wakeup(true);
			break;	
		}
		case USBD_RECIPIENT_ENDPOINT:
		{
			uint8_t ep = (setup.wIndex & USBD_EP_ADDRESS_EP_NUMBER);
			uint8_t dir =  (setup.wIndex & USBD_EP_ADDRESS_EP_DIRECTION) ? 1 : 0;
			ASSERT(config != NULL);
			ASSERT(config->is_endpoint_valid != NULL);
			if(!config->is_endpoint_valid(ep, dir))
			{
				USBD_ERROR_LOG(Invalid endpoint.);
				USBD_EP0_SET_STALL();
				return;
			}
			if (dir)
			{
				USBD_EP_SET_TX_STALL(ep);
			}
			else
			{
				USBD_EP_SET_RX_STALL(ep);
			}
			break;
		}
		default:
		{
			USBD_ERROR_LOG(Invalid bmRequestType. Unknown recipient);
			USBD_EP0_SET_STALL();
			return;
			break;			
		}
	}
	usbd_prepare_status_in_stage();
}

static void usbd_set_address(usbd_setup_packet_type setup)
{
	device_address = setup.wValue;
	usbd_prepare_status_in_stage();
}

static void usbd_get_descriptor(usbd_setup_packet_type setup)
{
	uint8_t *buf = NULL;
	uint32_t cnt = 0;

	switch ((((setup.wValue) >> 0x8U) & 0xFFU))
	{
		case USBD_DESC_TYPE_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->device_descriptor != NULL);
			buf = config->device_descriptor();
			cnt = setup.wLength;
			break;
		}
		case USBD_DESC_TYPE_CONFIGURATION:
		{
			ASSERT(config != NULL);
			ASSERT(config->configuration_descriptor != NULL);
			buf = config->configuration_descriptor(setup.wValue & 0xFFU);
			cnt = MIN(setup.wLength, (buf[2] | buf[3] << 8));
			break;
		}
		case USBD_DESC_TYPE_STRING:
		{
			ASSERT(config != NULL);
			ASSERT(config->string_descriptor != NULL);
			buf = config->string_descriptor((setup.wValue & 0xFFU), setup.wIndex);
			cnt = MIN(setup.wLength, buf[0]);
			break;
		}		
		case USBD_DESC_TYPE_BOS:
		{
			ASSERT(config != NULL);
			ASSERT(config->bos_descriptor != NULL);
			buf = config->bos_descriptor();
			cnt = setup.wLength;
			break;
		}
		default:
		{
			USBD_ERROR_LOG(Invalid descriptor request.);
			USBD_EP0_SET_STALL();
			return;
			break;
		}
	}
	usbd_prepare_data_in_stage(buf, cnt);
}

static void usbd_set_descriptor(usbd_setup_packet_type setup)
{
	ASSERT(config != NULL);
	ASSERT(config->set_descriptor != NULL);
	config->set_descriptor(setup);
}

static void usbd_get_configuration(usbd_setup_packet_type setup)
{
	UNUSED(setup);
	uint8_t buf = 0;
	ASSERT(config != NULL);
	ASSERT(config->get_configuration != NULL);
	buf = config->get_configuration();
	usbd_prepare_data_in_stage(&buf, USBD_GET_CONFIGURATION_LENGTH);
}

static void usbd_set_configuration(usbd_setup_packet_type setup)
{
	uint8_t num = (setup.wValue & 0xFFU);
	ASSERT(config != NULL);
	ASSERT(config->is_configuration_valid != NULL);
	if(!config->is_configuration_valid(num))
	{
		USBD_ERROR_LOG(Invalid configuration.);
		USBD_EP0_SET_STALL();
		return;
	}
	ASSERT(config->set_configuration != NULL);
	config->set_configuration(num);
	cur_state = num ? &configured_state : &addressed_state;
	usbd_prepare_status_in_stage();
}

static void usbd_get_interface(usbd_setup_packet_type setup)
{
	uint8_t num = (setup.wIndex & 0x7FU);
	uint8_t buf = 0;
	ASSERT(config != NULL);
	ASSERT(config->is_interface_valid != NULL);
	if(!config->is_interface_valid(num))
	{
		USBD_ERROR_LOG(Invalid interface.);
		USBD_EP0_SET_STALL();
		return;
	}
	ASSERT(config->get_interface != NULL);
	buf = config->get_interface(num);
	usbd_prepare_data_in_stage(&buf, USBD_GET_INTERFACE_LENGTH);
}

static void usbd_set_interface(usbd_setup_packet_type setup)
{
	uint8_t num = (setup.wIndex & 0x7FU);
	uint8_t alt = (setup.wValue & 0xFFU);
	ASSERT(config != NULL);
	ASSERT(config->is_interface_valid != NULL);
	if (!config->is_interface_valid(num))
	{
		USBD_ERROR_LOG(Invalid interface.);
		USBD_EP0_SET_STALL();		
	}
	ASSERT(config->set_interface != NULL);
	config->set_interface(num, alt);
	usbd_prepare_status_in_stage();	
}

static void usbd_synch_frame(usbd_setup_packet_type setup)
{
	uint8_t ep = (setup.wIndex & 0xFF);
	uint8_t buf[2];
	/*@todo check if endpoint iso*/
	/*@todo get frame number*/
	usbd_prepare_data_in_stage(buf, USBD_SYNCH_FRAME_LENGTH);
}

static void usbd_class_request(usbd_setup_packet_type setup)
{
	ASSERT(config != NULL);
	ASSERT(config->class_request != NULL);
	config->class_request(setup);
}

static void usbd_vendor_request(usbd_setup_packet_type setup)
{
	ASSERT(config != NULL);
	ASSERT(config->vendor_request != NULL);
	config->vendor_request(setup);
}
#if 0
static void usbd_event_enqueue(enum usbd_event e)
{
	ASSERT(!USBD_QUEUE_IS_FULL());
	queue.buffer[queue.head] = e;
	queue.head = USBD_QUEUE_NEXT_HEAD();
}

static enum usbd_event usbd_event_dequeue(void)
{
	enum usbd_event e = NONE;
	if (!USBD_QUEUE_IS_EMPTY())
	{
		e = queue.buffer[queue.tail];
		queue.tail = USBD_QUEUE_NEXT_TAIL();
	}
	return e;
}
#endif
static void usbd_event_generator(void)
{
	//enum usbd_event e = NONE;
	uint32_t istr = USB->ISTR;

	if (GET(istr, USB_ISTR_CTR))
	{
		uint8_t ep = GET(istr, USB_EP_EA);
		uint8_t dir = GET(*USBD_EP_REG(ep), USB_EP_CTR_TX) ? 1 : 0;
		ASSERT(ep_handler[ep][dir] != NULL);
		if (dir)
		{
			USBD_EP_CLEAR_CTR_TX(ep);
		}
		else
		{
			USBD_EP_CLEAR_CTR_RX(ep);
		}
		//cur_ep_handler = ep_handler[ep][dir];
		//e = CTR;
		if (USBD_EP_GET_SETUP(ep))
		{
			stage = usbd_setup_stage;
		}
		ep_handler[ep][dir]();

